---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.SpatialFieldManager
source: html/f6bf7b39-1fc9-58c6-5f25-b4b4b17cfeb4.htm
---
# SpatialFieldManager Properties

If true interactive settings dialog and pick deletion are allowed.